
// Ez a fájl SVG görbe adatokat tartalmaz a Hold árnyékának rendereléséhez.
// A tömb a telihold (egyenes vonal) és az újhold (teljes kör) közötti terminátor formáját írja le,
// finomabb lépésekben a pontosabb megjelenítés érdekében.
export const moonPhases = [
	"M16,0 A0,16 0 0,0 -16,0 A16,16 0 0,0 16,0",
	"M16,0 A1,16 0 0,0 -16,0 A16,16 0 0,0 16,0",
	"M16,0 A2,16 0 0,0 -16,0 A16,16 0 0,0 16,0",
	"M16,0 A3,16 0 0,0 -16,0 A16,16 0 0,0 16,0",
	"M16,0 A4,16 0 0,0 -16,0 A16,16 0 0,0 16,0",
	"M16,0 A5,16 0 0,0 -16,0 A16,16 0 0,0 16,0",
	"M16,0 A6,16 0 0,0 -16,0 A16,16 0 0,0 16,0",
	"M16,0 A7,16 0 0,0 -16,0 A16,16 0 0,0 16,0",
	"M16,0 A8,16 0 0,0 -16,0 A16,16 0 0,0 16,0",
	"M16,0 A9,16 0 0,0 -16,0 A16,16 0 0,0 16,0",
	"M16,0 A10,16 0 0,0 -16,0 A16,16 0 0,0 16,0",
	"M16,0 A11,16 0 0,0 -16,0 A16,16 0 0,0 16,0",
	"M16,0 A12,16 0 0,0 -16,0 A16,16 0 0,0 16,0",
	"M16,0 A13,16 0 0,0 -16,0 A16,16 0 0,0 16,0",
	"M16,0 A14,16 0 0,0 -16,0 A16,16 0 0,0 16,0",
	"M16,0 A15,16 0 0,0 -16,0 A16,16 0 0,0 16,0",
	"M16,0 A16,16 0 0,0 -16,0 A16,16 0 0,0 16,0"
];
